BenchBnB/BenchBnB/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "name", "email", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save